'''«Предложения по развитию Python» (англ. Python Enhancement Proposals, PEP) - предложения по улучшению языка от опытных разработчиков на Python.
PEP 8 - это руководство по стилю о том, как писать легкочитаемый код.
Оно содержит ряд руководящих принципов касательно имен переменных. Кратко перечислим их:
- имена модулей должны быть короткими и содержать только строчные буквы;
- имена классов должны быть в стиле CapWords;
- большинство переменных и имен функций должны писаться строчными_буквами_с_подчеркиваниями;
- постоянные (переменные, которые никогда не меняют значения) должны писаться ЗАГЛАВНЫМИ_БУКВАМИ_С_ПОДЧЕРКИВАНИЯМИ;
- имена, которые будут пересекаться с ключевыми словами Python (например, «class» или «if»), должны иметь замыкающее подчеркивание.

PEP 8 также рекомендует использовать пробелы вокруг операторов и после запятых, чтобы улучшить читаемость кода.
Среди других советов в PEP 8:
- строки не должны быть длиннее 80 символов;
- следует избегать «from module import *»;
- в строке должно быть не более одной инструкции.

Руководство также советует оформлять отступы пробелами, а не табуляцией.
Хотя в некоторой степени это зависит от личных предпочтений.
Если вы используете пробелы, используйте только 4 в строке. Важно выбрать один способ и придерживаться его.
'''