'''
Основные сторонние библиотеки:
- Django: наиболее широко используемый каркас веб-приложений, написанный на Python; на базе Django разработаны такие веб-сайты, как Instagram и Disqus.
В Django есть множество полезнейших функций, а недостаток любой функциональности легко устраняется путем выпуска пакетов расширения.
-CherryPy и Flask - также популярные каркасы веб-приложений.
- BeautifulSoup пригодится для вытягивания данных с веб-сайтов; так вы достигнете более хороших результатов, чем с собственным веб-скрепером на базе регулярных выражений.

Несмотря на то, что в Python есть модули для программного доступа к веб-сайтам (например, urllib), они довольно неудобны в использовании.
Запросы со сторонних библиотек - намного более простой способ работы с HTTP-запросами.

- Модуль matplotlib позволяет создавать графики на основе данных в Python.
- NumPy есть многомерные массивы, которые намного легковеснее, чем родные вложенные списки Python. Кроме этого есть функции для выполнения математических операций, таких как матричные преобразования в массивах.
- SciPy множество дополнений к функциональности в NumPy.
'''